// 1. 만~1 2. 1~10000 홀수만 찍으셈 

for(let i = 10000; i >= 1; i--) {
    if(i % 2 === 1) { 
        console.log(i)
    } 
}

// 한 놈은 주석질해야한다 잊지 마라!

for(let i = 1; i <= 10000; i++) {
    if(i % 2 === 0) {
        console.log(i)
    }
}

//구구단 for 문으로 만들어 오기
//구구단: 1, 2, 3, 4, 5, 6, 7, 8, 9 단 
// 1:1~9, 2:1~9 3:1~9 4:1~9 5:1~9 ... 단 
// 1. 1~9까지 하나씩 곱해주는 숫자 반복
// 2. 1~9단까지 단바꾸는 거
// i = 1 
// j = 1 

// i =1 j =~9
// i = 2 j = ~9
// i = 3 j = ~9 
for(let i = 1; i <= 9; i++) {
    for(let j = 1; j <= 9; j++) {
        console.log(i*j)
    }
}